imbluedabr/m33mu/cpu/stm32u585/stm32u585_mmio.c
/* m33mu -- an ARMv8-M Emulator
 *
 * Copyright (C) 2025  Daniele Lacamera <root@danielinux.net>
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU Affero General Public License as published
 * by the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU Affero General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 *
 * SPDX-License-Identifier: AGPL-3.0-or-later
 *
 */

#include <string.h>
#include <sys/random.h>
#include <stdlib.h>
#include <stdio.h>
#include "m33mu/pka.h"
#ifdef M33MU_HAS_WOLFSSL
#include <wolfssl/options.h>
#include <wolfssl/wolfcrypt/settings.h>
#include <wolfssl/wolfcrypt/aes.h>
#include <wolfssl/wolfcrypt/sha.h>
#include <wolfssl/wolfcrypt/sha256.h>
#include <wolfssl/wolfcrypt/sha512.h>
#endif
#include "stm32u585/stm32u585_mmio.h"
#include "m33mu/memmap.h"
#include "m33mu/flash_persist.h"
#include "m33mu/gpio.h"
#include "stm32_crypto.h"

extern void mm_system_request_reset(void);

/* RCC base addresses (system domain) */
#define RCC_BASE     0x46020c00u
#define RCC_SEC_BASE 0x56020c00u
#define RCC_SIZE     0x400u

#define RCC_CR       0x000u
#define RCC_CFGR1    0x01cu
#define RCC_CFGR2    0x020u
#define RCC_PLL1CFGR 0x028u
#define RCC_PLL1DIVR 0x034u
#define RCC_PLL2CFGR 0x02cu
#define RCC_PLL3CFGR 0x030u
#define RCC_PLL2DIVR 0x03cu
#define RCC_PLL2FRACR 0x040u
#define RCC_PLL3DIVR 0x044u
#define RCC_PLL3FRACR 0x048u

/* PWR base (system domain) */
#define PWR_BASE     0x46020800u
#define PWR_SEC_BASE 0x56020800u
#define PWR_SIZE     0x400u
#define PWR_VOSR     0x00cu
#define PWR_SVMSR    0x03cu

/* FLASH controller base */
#define FLASH_BASE   0x40022000u
#define FLASH_SEC_BASE 0x50022000u
#define FLASH_SIZE   0x400u

/* GTZC1/2 TZSC/TZIC (secure / non-secure aliases) */
#define GTZC1_TZSC_S_BASE  0x50032400u
#define GTZC1_TZSC_NS_BASE 0x40032400u
#define GTZC1_TZIC_S_BASE  0x50032800u
#define GTZC1_TZIC_NS_BASE 0x40032800u
#define GTZC2_TZSC_S_BASE  0x56023000u
#define GTZC2_TZSC_NS_BASE 0x46023000u
#define GTZC2_TZIC_S_BASE  0x56023400u
#define GTZC2_TZIC_NS_BASE 0x46023400u
#define GTZC_TZSC_SIZE 0x400u
#define GTZC_TZIC_SIZE 0x400u
#define GTZC_BLK_SIZE 0x1000u

/* RNG base addresses */
#define RNG_BASE     0x420c0800u
#define RNG_SEC_BASE 0x520c0800u
#define RNG_SIZE     0x400u

/* AES/HASH/SAES/PKA base addresses */
#define AES_BASE     0x420c0000u
#define AES_SEC_BASE 0x520c0000u
#define AES_SIZE     0x400u
#define HASH_BASE     0x420c0400u
#define HASH_SEC_BASE 0x520c0400u
#define HASH_SIZE     0x400u
#define SAES_BASE     0x420c0c00u
#define SAES_SEC_BASE 0x520c0c00u
#define SAES_SIZE     0x400u
#define PKA_BASE     0x420c2000u
#define PKA_SEC_BASE 0x520c2000u
#define PKA_SIZE     0x2000u

/* MPCBB base addresses */
#define MPCBB1_BASE     0x40032c00u
#define MPCBB1_SEC_BASE 0x50032c00u
#define MPCBB2_BASE     0x40033000u
#define MPCBB2_SEC_BASE 0x50033000u
#define MPCBB3_BASE     0x40033400u
#define MPCBB3_SEC_BASE 0x50033400u
#define MPCBB4_BASE     0x46023800u
#define MPCBB4_SEC_BASE 0x56023800u
#define MPCBB_SIZE      0x400u

/* EXTI base addresses */
#define EXTI_BASE     0x46022000u
#define EXTI_SEC_BASE 0x56022000u
#define EXTI_SIZE     0x400u

/* IWDG/WWDG base addresses */
#define IWDG_BASE     0x40003000u
#define IWDG_SEC_BASE 0x50003000u
#define IWDG_SIZE     0x400u
#define WWDG_BASE     0x40002C00u
#define WWDG_SEC_BASE 0x50002C00u
#define WWDG_SIZE     0x400u

/* UCPD1 base addresses */
#define UCPD1_BASE     0x4000DC00u
#define UCPD1_SEC_BASE 0x5000DC00u
#define UCPD1_SIZE     0x400u

/* CRS base addresses */
#define CRS_BASE     0x40006000u
#define CRS_SEC_BASE 0x50006000u
#define CRS_SIZE     0x400u

/* OTG FS base addresses */
#define OTG_FS_BASE     0x42040000u
#define OTG_FS_SEC_BASE 0x52040000u
#define OTG_FS_SIZE     0x1000u

/* UCPD1 register offsets (subset) */
#define UCPD_CFGR1 0x000u
#define UCPD_CR    0x00Cu
#define UCPD_IMR   0x010u
#define UCPD_SR    0x014u
#define UCPD_ICR   0x018u

/* UCPD1 bits (subset) */
#define UCPD_CFGR1_UCPDEN (1u << 31)
#define UCPD_CR_ANAMODE   (1u << 9)
#define UCPD_CR_CCENABLE_0 (1u << 10)
#define UCPD_CR_CCENABLE_1 (1u << 11)
#define UCPD_CR_CCENABLE_BOTH (UCPD_CR_CCENABLE_0 | UCPD_CR_CCENABLE_1)
#define UCPD_SR_TYPECEVT1 (1u << 14)
#define UCPD_SR_TYPECEVT2 (1u << 15)
#define UCPD_SR_TYPEC_VSTATE_CC1_Pos 16u
#define UCPD_SR_TYPEC_VSTATE_CC2_Pos 18u
#define UCPD_SR_TYPEC_VSTATE_CC_Msk (0x3u << UCPD_SR_TYPEC_VSTATE_CC1_Pos)
#define UCPD_SR_TYPEC_VSTATE_CC2_Msk (0x3u << UCPD_SR_TYPEC_VSTATE_CC2_Pos)
#define UCPD_ICR_TYPECEVT1CF (1u << 14)
#define UCPD_ICR_TYPECEVT2CF (1u << 15)

#define RNG_CR_OFFSET   0x0u
#define RNG_SR_OFFSET   0x4u
#define RNG_DR_OFFSET   0x8u
#define RNG_NSCR_OFFSET 0xcu
#define RNG_HTCR_OFFSET 0x10u

/* AES register offsets (subset) */
#define AES_CR    0x000u
#define AES_SR    0x004u
#define AES_DINR  0x008u
#define AES_DOUTR 0x00cu
#define AES_KEYR0 0x010u
#define AES_KEYR1 0x014u
#define AES_KEYR2 0x018u
#define AES_KEYR3 0x01cu
#define AES_IVR0  0x020u
#define AES_IVR1  0x024u
#define AES_IVR2  0x028u
#define AES_IVR3  0x02cu
#define AES_KEYR4 0x030u
#define AES_KEYR5 0x034u
#define AES_KEYR6 0x038u
#define AES_KEYR7 0x03cu
#define AES_IER   0x300u
#define AES_ISR   0x304u
#define AES_ICR   0x308u

#define AES_CR_EN        (1u << 0)
#define AES_CR_DATATYPE_SHIFT 1u
#define AES_CR_MODE_SHIFT 3u
#define AES_CR_CHMOD_SHIFT 5u
#define AES_CR_CHMOD_MASK (0x3u << AES_CR_CHMOD_SHIFT)
#define AES_CR_DMAINEN  (1u << 11)
#define AES_CR_DMAOUTEN (1u << 12)
#define AES_CR_CHMOD2   (1u << 16)
#define AES_CR_KEYSIZE  (1u << 18)
#define AES_CR_GCMPH_SHIFT 13u
#define AES_CR_GCMPH_MASK (0x3u << AES_CR_GCMPH_SHIFT)
#define AES_CR_NPBLB_SHIFT 20u
#define AES_CR_IPRST    (1u << 31)

#define AES_SR_CCF      (1u << 0)
#define AES_SR_RDERR    (1u << 1)
#define AES_SR_WRERR    (1u << 2)
#define AES_SR_BUSY     (1u << 3)
#define AES_SR_KEYVALID (1u << 7)

/* HASH register offsets (subset) */
#define HASH_CR   0x000u
#define HASH_DIN  0x004u
#define HASH_STR  0x008u
#define HASH_HRA0 0x00cu
#define HASH_HRA1 0x010u
#define HASH_HRA2 0x014u
#define HASH_HRA3 0x018u
#define HASH_HRA4 0x01cu
#define HASH_IMR  0x020u
#define HASH_SR   0x024u
#define HASH_CSR0 0x0f8u
#define HASH_HR0  0x310u

#define HASH_CR_INIT      (1u << 2)
#define HASH_CR_DATATYPE_SHIFT 4u
#define HASH_CR_MODE      (1u << 6)
#define HASH_CR_ALGO_SHIFT 17u

#define HASH_STR_NBLW_MASK 0x1fu
#define HASH_STR_DCAL      (1u << 8)

#define HASH_SR_DINIS (1u << 0)
#define HASH_SR_DCIS  (1u << 1)
#define HASH_SR_DMAS  (1u << 2)
#define HASH_SR_BUSY  (1u << 3)
#define HASH_SR_NBWP_SHIFT 9u
#define HASH_SR_DINNE (1u << 15)
#define HASH_SR_NBWE_SHIFT 16u

#define TZSC_SECCFGR3_OFFSET 0x18u
#define TZSC_AESSEC_BIT 11u
#define TZSC_HASHSEC_BIT 12u
#define TZSC_PKASEC_BIT 14u
#define TZSC_SAESSEC_BIT 15u

/* EXTI offsets (subset) */
#define EXTI_RTSR1  0x000u
#define EXTI_FTSR1  0x004u
#define EXTI_SWIER1 0x008u
#define EXTI_RPR1   0x00Cu
#define EXTI_FPR1   0x010u
#define EXTI_EXTICR1 0x060u
#define EXTI_EXTICR2 0x064u
#define EXTI_EXTICR3 0x068u
#define EXTI_EXTICR4 0x06Cu
#define EXTI_IMR1   0x080u
#define EXTI_EMR1   0x084u

/* WWDG offsets */
#define WWDG_CR  0x000u
#define WWDG_CFR 0x004u
#define WWDG_SR  0x008u

/* IWDG offsets */
#define IWDG_KR   0x000u
#define IWDG_PR   0x004u
#define IWDG_RLR  0x008u
#define IWDG_SR   0x00Cu
#define IWDG_WINR 0x010u
#define IWDG_EWCR 0x014u

#define GPIO_IDR_OFFSET 0x10u
#define GPIO_ODR_OFFSET 0x14u

/* MPCBB offsets */
#define MPCBB_CR_OFFSET      0x000u
#define MPCBB_SECCFGR_OFFSET 0x100u
#define MPCBB_CR_INVSECSTATE (1u << 30)

/* FLASH register offsets */
#define FLASH_ACR      0x000u
#define FLASH_NSKEYR   0x004u
#define FLASH_SECKEYR  0x008u
#define FLASH_NSSR     0x020u
#define FLASH_SECSR    0x024u
#define FLASH_NSCR     0x028u
#define FLASH_SECCR    0x02cu
#define FLASH_NSCCR    0x030u
#define FLASH_SECCCR   0x034u
#define FLASH_OPTR     0x040u

