imbluedabr/m33mu/cpu/stm32u585/stm32u585_mmio.c
static mm_bool hash_clock_enabled(const struct rcc_state *rcc)
{
    return ((rcc->regs[0x8c / 4u] >> 17) & 1u) != 0u;
}

static mm_bool aes_clock_enabled(const struct rcc_state *rcc, mm_bool is_saes)
{
    mm_u32 bit = is_saes ? 20u : 16u;
    return ((rcc->regs[0x8c / 4u] >> bit) & 1u) != 0u;
}

static mm_bool pka_clock_enabled(const struct rcc_state *rcc)
{
    return ((rcc->regs[0x8c / 4u] >> 19) & 1u) != 0u;
}


static mm_bool otg_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct otg_state *o = (struct otg_state *)opaque;
    if (o == 0 || value_out == 0) {
        return MM_FALSE;
    }
    if (size_bytes == 0 || size_bytes > 4u) {
        return MM_FALSE;
    }
    if ((offset + size_bytes) > OTG_FS_SIZE) {
        return MM_FALSE;
    }
    memcpy(value_out, (mm_u8 *)o->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool otg_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct otg_state *o = (struct otg_state *)opaque;
    if (o == 0) {
        return MM_FALSE;
    }
    if (size_bytes == 0 || size_bytes > 4u) {
        return MM_FALSE;
    }
    if ((offset + size_bytes) > OTG_FS_SIZE) {
        return MM_FALSE;
    }
    memcpy((mm_u8 *)o->regs + offset, &value, size_bytes);
    return MM_TRUE;
}

static mm_bool flash_trace_enabled(void)
{
    static mm_bool init = MM_FALSE;
    static mm_bool enabled = MM_FALSE;
    if (!init) {
        const char *env = getenv("M33MU_FLASH_TRACE");
        enabled = (env != 0 && env[0] != '\0') ? MM_TRUE : MM_FALSE;
        init = MM_TRUE;
    }
    return enabled;
}

static mm_bool stm32u585_rcc_clock_list_line(void *opaque, int line, char *out, size_t out_len);

static mm_bool stm32u585_gpio_bank_info(void *opaque, int bank, char *name_out, size_t name_len, int *pins_out)
{
    (void)opaque;
    if (bank < 0 || bank >= 9) {
        return MM_FALSE;
    }
    if (name_out != 0 && name_len > 0u) {
        name_out[0] = (char)('A' + bank);
        if (name_len > 1u) {
            name_out[1] = '\0';
        }
    }
    if (pins_out != 0) {
        *pins_out = 16;
    }
    return MM_TRUE;
}

void mm_stm32u585_mmio_reset(void)
{
    size_t i;
    mm_u32 optr_swap = flash_ctl.regs[FLASH_OPTR / 4u] & FLASH_OPTR_SWAP_BANK;
    mm_bool dualbank = flash_ctl.dualbank_enabled;
    memset(&rcc, 0, sizeof(rcc));
    memset(&pwr, 0, sizeof(pwr));
    memset(&tzsc_s, 0, sizeof(tzsc_s));
    memset(&tzsc_ns, 0, sizeof(tzsc_ns));
    memset(&tzic_s, 0, sizeof(tzic_s));
    memset(&tzic_ns, 0, sizeof(tzic_ns));
    memset(&tzsc2_s, 0, sizeof(tzsc2_s));
    memset(&tzsc2_ns, 0, sizeof(tzsc2_ns));
    memset(&tzic2_s, 0, sizeof(tzic2_s));
    memset(&tzic2_ns, 0, sizeof(tzic2_ns));
    memset(&crs, 0, sizeof(crs));
    memset(&crs_sec, 0, sizeof(crs_sec));
    memset(&ucpd1_state, 0, sizeof(ucpd1_state));
    memset(&ucpd1_state_sec, 0, sizeof(ucpd1_state_sec));
    memset(&otg_fs, 0, sizeof(otg_fs));
    memset(&otg_fs_sec, 0, sizeof(otg_fs_sec));
    memset(&rng, 0, sizeof(rng));
    memset(&hash_accel, 0, sizeof(hash_accel));
    memset(&aes_accel, 0, sizeof(aes_accel));
    memset(&saes_accel, 0, sizeof(saes_accel));
    memset(&pka_accel, 0, sizeof(pka_accel));
    memset(&exti, 0, sizeof(exti));
    memset(&iwdg, 0, sizeof(iwdg));
    memset(&wwdg, 0, sizeof(wwdg));
    memset(&flash_ctl, 0, sizeof(flash_ctl));
    flash_ctl.dualbank_enabled = dualbank;
    flash_ctl.swap_active = (optr_swap != 0u) ? MM_TRUE : MM_FALSE;
    mpcbb_init_defaults();
    memset(&gpdma1, 0, sizeof(gpdma1));
    for (i = 0; i < sizeof(gpio) / sizeof(gpio[0]); ++i) {
        memset(&gpio[i], 0, sizeof(gpio[i]));
    }
    mm_gpio_bank_set_reader(stm32u585_gpio_bank_read, 0);
    mm_gpio_bank_set_moder_reader(stm32u585_gpio_bank_read_moder, 0);
    mm_gpio_bank_set_clock_reader(stm32u585_gpio_bank_clock, 0);
    mm_gpio_bank_set_seccfgr_reader(stm32u585_gpio_bank_read_seccfgr, 0);
    mm_gpio_set_bank_info_reader(stm32u585_gpio_bank_info, 0);
    mm_rcc_set_clock_list_reader(stm32u585_rcc_clock_list_line, 0);
    /* Enable HSI by default and mark ready flags. */
    rcc.regs[0] |= 1u;
    rcc_update_ready(&rcc);
    rcc_update_sysclk(&rcc);
    iwdg.regs[IWDG_RLR / 4u] = 0x00000FFFu;
    iwdg.regs[IWDG_WINR / 4u] = 0x00000FFFu;
    wwdg.regs[WWDG_CR / 4u] = 0x0000007Fu;
    wwdg.regs[WWDG_CFR / 4u] = 0x0000007Fu;
    wwdg.counter = 0x7Fu;
    exti.regs[EXTI_IMR1 / 4u] = 0xFFFE0000u;
    /* Power ready flags. */
    pwr_update_vos(&pwr);

    /* RNG reset values */
    rng.regs[RNG_CR_OFFSET / 4] = 0x00871f00u;
    rng.regs[RNG_HTCR_OFFSET / 4] = 0x000072acu;
    hash_reset_state(&hash_accel, MM_TRUE);
    mm_pka_reset(&pka_accel);

    /* FLASH reset values */
    flash_ctl.regs[FLASH_ACR / 4] = 0x00000013u;
    flash_ctl.regs[FLASH_NSCR / 4] = 0x00000001u;
    flash_ctl.regs[FLASH_SECCR / 4] = 0x00000001u;
    flash_sync_option_regs(&flash_ctl);
}

mm_u32 *mm_stm32u585_tzsc_regs(void)
{
    return tzsc_s.regs;
}

mm_u32 *mm_stm32u585_tzsc2_regs(void)
{
    return tzsc2_s.regs;
}

mm_bool mm_stm32u585_mpcbb_block_secure(int bank, mm_u32 block_index)
{
    mm_u32 word;
    mm_u32 bit;
    mm_u32 val;
    mm_bool sec;
    if (bank < 0 || bank >= (int)(sizeof(mpcbb) / sizeof(mpcbb[0]))) {
        return MM_FALSE;
    }
    word = block_index / 32u;
    if (word >= mpcbb_words[bank]) {
        return MM_FALSE;
    }
    bit = block_index % 32u;
    val = mpcbb[bank].regs[(MPCBB_SECCFGR_OFFSET / 4u) + word];
    sec = ((val >> bit) & 1u) != 0u;
    if ((mpcbb[bank].regs[MPCBB_CR_OFFSET / 4u] & MPCBB_CR_INVSECSTATE) != 0u) {
        sec = !sec;
    }
    return sec;
}

static mm_bool gpio_clock_enabled(const struct rcc_state *rcc, int index)
{
    /* AHB2ENR offset 0x8C, GPIOAEN bit0..GPIOIEN bit8 */
    mm_u32 ahb2enr = rcc->regs[0x8c / 4];
    return ((ahb2enr >> index) & 1u) != 0u;
}

enum rcc_bus_kind {
    RCC_BUS_AHB2 = 0,
    RCC_BUS_APB1L = 1,
    RCC_BUS_APB1H = 2,
    RCC_BUS_APB2 = 3,
    RCC_BUS_APB3 = 4
};

