imbluedabr/m33mu/cpu/stm32u585/stm32u585_mmio.c
static void flash_sync_option_regs(struct flash_state *f)
{
    mm_u32 val;
    if (f == 0) {
        return;
    }
    if (!f->dualbank_enabled) {
        f->swap_active = MM_FALSE;
    }
    val = f->regs[FLASH_OPTR / 4u];
    val &= ~(FLASH_OPTR_SWAP_BANK | FLASH_OPTR_DUALBANK);
    if (f->swap_active) {
        val |= FLASH_OPTR_SWAP_BANK;
    }
    if (f->dualbank_enabled) {
        val |= FLASH_OPTR_DUALBANK;
    }
    f->regs[FLASH_OPTR / 4u] = val;
}

static mm_u32 flash_sector_size(void)
{
    mm_u32 banks = flash_bank_count(&flash_ctl);
    if (flash_ctl.flash_size == 0u) {
        return 0u;
    }
    if (banks == 0u || (flash_ctl.flash_size % banks) != 0u) {
        banks = 1u;
    }
    return (FLASH_SECTOR_COUNT == 0u) ? 0u
        : ((flash_ctl.flash_size / banks) / FLASH_SECTOR_COUNT);
}

static void flash_set_busy(mm_u32 reg_offset, mm_bool busy)
{
    mm_u32 idx = reg_offset / 4u;
    if (busy) {
        flash_ctl.regs[idx] |= FLASH_FLAG_BSY;
    } else {
        flash_ctl.regs[idx] &= ~FLASH_FLAG_BSY;
    }
}

static void flash_set_eop(mm_u32 reg_offset)
{
    flash_ctl.regs[reg_offset / 4u] |= FLASH_FLAG_EOP;
}

static void flash_clear_eop(mm_u32 reg_offset)
{
    flash_ctl.regs[reg_offset / 4u] &= ~FLASH_FLAG_EOP;
}

static mm_bool flash_is_unlocked(mm_u32 reg_offset)
{
    return (flash_ctl.regs[reg_offset / 4u] & FLASH_CR_LOCK) == 0u;
}

static void flash_handle_key(mm_u32 offset, mm_u32 value)
{
    mm_u8 *stage = (offset == FLASH_NSKEYR) ? &flash_ctl.ns_key_stage : &flash_ctl.sec_key_stage;
    mm_u32 cr_off = (offset == FLASH_NSKEYR) ? FLASH_NSCR : FLASH_SECCR;
    if (*stage == 0u) {
        if (value == FLASH_KEY1) {
            *stage = 1u;
        } else {
            *stage = 0u;
        }
        return;
    }
    if (*stage == 1u) {
        if (value == FLASH_KEY2) {
            flash_ctl.regs[cr_off / 4u] &= ~FLASH_CR_LOCK;
        }
        *stage = 0u;
    }
}

static void flash_apply_erase(mm_u32 cr_off, mm_u32 sr_off)
{
    mm_u32 cr = flash_ctl.regs[cr_off / 4u];
    mm_u32 sector_size = flash_sector_size();
    mm_u32 bank_size = 0;
    mm_u32 bank_offset = 0;
    mm_u32 bank_count = flash_bank_count(&flash_ctl);
    mm_u32 start = 0;
    mm_u32 length = 0;
    if (flash_ctl.flash == 0 || flash_ctl.flash_size == 0 || sector_size == 0) {
        return;
    }
    if ((cr & FLASH_CR_BER) != 0u) {
        start = 0;
        length = flash_ctl.flash_size;
    } else if ((cr & FLASH_CR_SER) != 0u) {
        mm_u32 snb = (cr & FLASH_CR_SNB_MASK) >> FLASH_CR_SNB_SHIFT;
        start = snb * sector_size;
        if (FLASH_BANK_COUNT > 1u && flash_ctl.flash_size >= FLASH_BANK_COUNT) {
            bank_size = flash_ctl.flash_size / FLASH_BANK_COUNT;
        } else if (bank_count != 0u) {
            bank_size = flash_ctl.flash_size / bank_count;
        }
        if (bank_size != 0u && (cr & FLASH_CR_BKSEL) != 0u) {
            bank_offset = bank_size;
            start += bank_offset;
        }
        if (start >= flash_ctl.flash_size) {
            return;
        }
        length = sector_size;
        if (start + length > flash_ctl.flash_size) {
            length = flash_ctl.flash_size - start;
        }
    } else {
        return;
    }
    if (flash_trace_enabled()) {
        const char *sec = (cr_off == FLASH_SECCR) ? "S" : "NS";
        const char *mode = (cr & FLASH_CR_BER) ? "BER" : "SER";
        mm_u32 snb = (cr & FLASH_CR_SNB_MASK) >> FLASH_CR_SNB_SHIFT;
        printf("[FLASH_ERASE] %s mode=%s snb=%lu start=0x%08lx len=0x%08lx\n",
               sec,
               mode,
               (unsigned long)snb,
               (unsigned long)start,
               (unsigned long)length);
    }
    flash_set_busy(sr_off, MM_TRUE);
    memset(flash_ctl.flash + start, 0xFF, length);
    flash_set_busy(sr_off, MM_FALSE);
    flash_set_eop(sr_off);
    if (flash_ctl.persist != 0 && flash_ctl.persist->enabled) {
        mm_flash_persist_flush((struct mm_flash_persist *)flash_ctl.persist, start, length);
    }
}

static mm_bool flash_write_cb(void *opaque, enum mm_sec_state sec, mm_u32 addr, mm_u32 size_bytes, mm_u32 value)
{
    mm_u32 base;
    mm_u32 offset;
    mm_u32 cr_off;
    mm_u32 sr_off;
    mm_u32 i;
    mm_bool erase_mode;
    mm_bool erase_value;
    (void)opaque;

    if (flash_ctl.flash == 0 || flash_ctl.flash_size == 0) {
        return MM_FALSE;
    }
    if (addr >= flash_ctl.base_s && addr < flash_ctl.base_s + flash_ctl.flash_size) {
        base = flash_ctl.base_s;
    } else if (addr >= flash_ctl.base_ns && addr < flash_ctl.base_ns + flash_ctl.flash_size) {
        base = flash_ctl.base_ns;
    } else {
        return MM_FALSE;
    }
    offset = addr - base;
    cr_off = (sec == MM_SECURE) ? FLASH_SECCR : FLASH_NSCR;
    sr_off = (sec == MM_SECURE) ? FLASH_SECSR : FLASH_NSSR;

    if (offset + size_bytes > flash_ctl.flash_size) {
        return MM_FALSE;
    }
    if (flash_trace_enabled()) {
        printf("[FLASH_WRITE] %s addr=0x%08lx size=%lu value=0x%08lx\n",
               (sec == MM_SECURE) ? "S" : "NS",
               (unsigned long)addr,
               (unsigned long)size_bytes,
               (unsigned long)value);
    }
    if (!flash_is_unlocked(cr_off)) {
        return MM_TRUE;
    }
    if ((flash_ctl.regs[cr_off / 4u] & FLASH_CR_PG) == 0u) {
        return MM_TRUE;
    }

    erase_mode = ((flash_ctl.regs[cr_off / 4u] & FLASH_CR_SER) != 0u) ? MM_TRUE : MM_FALSE;
    erase_value = MM_FALSE;
    if (erase_mode) {
        if (size_bytes == 4u) {
            erase_value = (value == 0xFFFFFFFFu) ? MM_TRUE : MM_FALSE;
        } else if (size_bytes == 2u) {
            erase_value = ((value & 0xFFFFu) == 0xFFFFu) ? MM_TRUE : MM_FALSE;
        } else if (size_bytes == 1u) {
            erase_value = ((value & 0xFFu) == 0xFFu) ? MM_TRUE : MM_FALSE;
        }
    }

    if ((flash_ctl.flags & MM_TARGET_FLAG_NVM_WRITEONCE) != 0u && !(erase_mode && erase_value)) {
        for (i = 0; i < size_bytes; ++i) {
            if (flash_ctl.flash[offset + i] != 0xFFu) {
                flash_ctl.regs[sr_off / 4u] |= FLASH_FLAG_PGSERR;
                return MM_TRUE;
            }
        }
    }

    if (size_bytes == 4u) {
        flash_ctl.flash[offset] &= (mm_u8)(value & 0xFFu);
        flash_ctl.flash[offset + 1u] &= (mm_u8)((value >> 8) & 0xFFu);
        flash_ctl.flash[offset + 2u] &= (mm_u8)((value >> 16) & 0xFFu);
        flash_ctl.flash[offset + 3u] &= (mm_u8)((value >> 24) & 0xFFu);
    } else if (size_bytes == 2u) {
        flash_ctl.flash[offset] &= (mm_u8)(value & 0xFFu);
        flash_ctl.flash[offset + 1u] &= (mm_u8)((value >> 8) & 0xFFu);
    } else if (size_bytes == 1u) {
        flash_ctl.flash[offset] &= (mm_u8)(value & 0xFFu);
    } else {
        return MM_FALSE;
    }
    flash_set_eop(sr_off);
    if (flash_ctl.persist != 0 && flash_ctl.persist->enabled) {
        mm_flash_persist_flush((struct mm_flash_persist *)flash_ctl.persist, offset, size_bytes);
    }
    return MM_TRUE;
}

