imbluedabr/m33mu/cpu/stm32u585/stm32u585_mmio.c
    if (offset == FLASH_NSCR || offset == FLASH_SECCR) {
        cr_off = offset;
        sr_off = (offset == FLASH_NSCR) ? FLASH_NSSR : FLASH_SECSR;
        if (!flash_is_unlocked(cr_off) && (value & FLASH_CR_LOCK) == 0u) {
            return MM_TRUE;
        }
        memcpy((mm_u8 *)f->regs + offset, &value, size_bytes);
        if ((value & FLASH_CR_LOCK) != 0u) {
            f->regs[cr_off / 4u] |= FLASH_CR_LOCK;
        }
        if ((value & FLASH_CR_STRT) != 0u) {
            flash_apply_erase(cr_off, sr_off);
            f->regs[cr_off / 4u] &= ~FLASH_CR_STRT;
        }
        return MM_TRUE;
    }

    memcpy((mm_u8 *)f->regs + offset, &value, size_bytes);
    return MM_TRUE;
}

static mm_bool rng_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct rng_state *r = ((struct rng_state *)((void **)opaque)[0]);
    mm_bool secure_alias = ((void **)opaque)[1] != 0;
    struct rcc_state *rcc = (struct rcc_state *)((void **)opaque)[2];
    struct simple_blk *tzsc = (struct simple_blk *)((void **)opaque)[3];

    if (value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > RNG_SIZE) return MM_FALSE;

    if (!secure_alias && rng_requires_secure(tzsc)) {
        *value_out = 0;
        return MM_TRUE;
    }
    if (!rng_clock_enabled(rcc)) {
        *value_out = 0;
        return MM_TRUE;
    }

    if (offset == RNG_SR_OFFSET) {
        if (!r->dr_valid) {
            rng_fill(r);
        }
        *value_out = r->regs[RNG_SR_OFFSET / 4];
        return MM_TRUE;
    }
    if (offset == RNG_DR_OFFSET) {
        if (!r->dr_valid) {
            rng_fill(r);
        }
        *value_out = r->dr;
        r->dr_valid = MM_FALSE;
        r->regs[RNG_SR_OFFSET / 4] &= ~1u;
        return MM_TRUE;
    }

    memcpy(value_out, (mm_u8 *)r->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool rng_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct rng_state *r = ((struct rng_state *)((void **)opaque)[0]);
    mm_bool secure_alias = ((void **)opaque)[1] != 0;
    struct rcc_state *rcc = (struct rcc_state *)((void **)opaque)[2];
    struct simple_blk *tzsc = (struct simple_blk *)((void **)opaque)[3];

    if (size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > RNG_SIZE) return MM_FALSE;

    if (!secure_alias && rng_requires_secure(tzsc)) {
        return MM_TRUE;
    }
    if (!rng_clock_enabled(rcc)) {
        return MM_TRUE;
    }

    if (offset == RNG_SR_OFFSET || offset == RNG_DR_OFFSET) {
        return MM_TRUE;
    }

    memcpy((mm_u8 *)r->regs + offset, &value, size_bytes);
    if (offset == RNG_CR_OFFSET) {
        if ((value & (1u << 2)) == 0u) {
            r->dr_valid = MM_FALSE;
            r->regs[RNG_SR_OFFSET / 4] &= ~1u;
        }
        if ((value & (1u << 3)) != 0u) {
            if (g_rng_nvic != 0 && (r->regs[RNG_SR_OFFSET / 4] & 1u) != 0u) {
                mm_nvic_set_pending(g_rng_nvic, (mm_u32)RNG_IRQ, MM_TRUE);
            }
        }
    }
    return MM_TRUE;
}

static mm_bool wwdg_clock_enabled(void)
{
    return ((rcc.regs[0x9c / 4] >> 11) & 1u) != 0u;
}

static int exti_line_bank(int line)
{
    mm_u32 reg;
    mm_u32 shift;
    mm_u32 val;
    if (line < 0 || line > 15) return -1;
    reg = exti.regs[(EXTI_EXTICR1 + (mm_u32)(line / 4) * 4u) / 4u];
    shift = (mm_u32)(line % 4) * 8u;
    val = (reg >> shift) & 0xFFu;
    if (val > 8u) return -1;
    return (int)val;
}

static void exti_raise_irq(int line)
{
    if (g_exti_nvic != 0) {
        mm_nvic_set_pending(g_exti_nvic, (mm_u32)(11 + line), MM_TRUE);
    }
}

static void exti_set_pending_rise(int line)
{
    exti.regs[EXTI_RPR1 / 4u] |= (1u << line);
    if ((exti.regs[EXTI_IMR1 / 4u] & (1u << line)) != 0u) {
        exti_raise_irq(line);
    }
}

static void exti_set_pending_fall(int line)
{
    exti.regs[EXTI_FPR1 / 4u] |= (1u << line);
    if ((exti.regs[EXTI_IMR1 / 4u] & (1u << line)) != 0u) {
        exti_raise_irq(line);
    }
}

static void exti_gpio_update(int bank, mm_u32 old_level, mm_u32 new_level)
{
    int line;
    mm_u32 changed = old_level ^ new_level;
    if (changed == 0u) return;
    for (line = 0; line < 16; ++line) {
        mm_u32 mask = (1u << line);
        if ((changed & mask) == 0u) continue;
        if (exti_line_bank(line) != bank) continue;
        if ((new_level & mask) != 0u) {
            if ((exti.regs[EXTI_RTSR1 / 4u] & mask) != 0u) {
                exti_set_pending_rise(line);
            }
        } else {
            if ((exti.regs[EXTI_FTSR1 / 4u] & mask) != 0u) {
                exti_set_pending_fall(line);
            }
        }
    }
}

static mm_bool exti_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct exti_state *e = (struct exti_state *)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > EXTI_SIZE) return MM_FALSE;
    if (offset == EXTI_SWIER1) {
        *value_out = 0;
        return MM_TRUE;
    }
    memcpy(value_out, (mm_u8 *)e->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool exti_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct exti_state *e = (struct exti_state *)opaque;
    int line;
    if (size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > EXTI_SIZE) return MM_FALSE;
    if (offset == EXTI_SWIER1) {
        mm_u32 v = value & 0xFFFFu;
        for (line = 0; line < 16; ++line) {
            if ((v & (1u << line)) != 0u) {
                exti_set_pending_rise(line);
            }
        }
        return MM_TRUE;
    }
    if (offset == EXTI_RPR1) {
        e->regs[offset / 4u] &= ~value;
        return MM_TRUE;
    }
    if (offset == EXTI_FPR1) {
        e->regs[offset / 4u] &= ~value;
        return MM_TRUE;
    }
    memcpy((mm_u8 *)e->regs + offset, &value, size_bytes);
    return MM_TRUE;
}

static mm_bool iwdg_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct iwdg_state *w = (struct iwdg_state *)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > IWDG_SIZE) return MM_FALSE;
    if (offset == IWDG_KR) {
        *value_out = 0;
        return MM_TRUE;
    }
    memcpy(value_out, (mm_u8 *)w->regs + offset, size_bytes);
    return MM_TRUE;
}

