imbluedabr/m33mu/cpu/stm32u585/stm32u585_mmio.c
static void iwdg_apply_key(struct iwdg_state *w, mm_u32 key)
{
    if (key == 0x5555u) {
        w->write_access = MM_TRUE;
    } else if (key == 0xAAAAu) {
        w->counter = w->regs[IWDG_RLR / 4u] & 0x0FFFu;
    } else if (key == 0xCCCCu) {
        w->running = MM_TRUE;
        w->write_access = MM_FALSE;
        w->counter = w->regs[IWDG_RLR / 4u] & 0x0FFFu;
    }
}

static mm_bool iwdg_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct iwdg_state *w = (struct iwdg_state *)opaque;
    if (size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > IWDG_SIZE) return MM_FALSE;
    if (offset == IWDG_KR) {
        iwdg_apply_key(w, value & 0xFFFFu);
        return MM_TRUE;
    }
    if (!w->write_access) {
        return MM_TRUE;
    }
    if (offset == IWDG_PR) {
        w->regs[IWDG_PR / 4u] = value & 0x7u;
        return MM_TRUE;
    }
    if (offset == IWDG_RLR) {
        w->regs[IWDG_RLR / 4u] = value & 0x0FFFu;
        return MM_TRUE;
    }
    if (offset == IWDG_WINR) {
        w->regs[IWDG_WINR / 4u] = value & 0x0FFFu;
        return MM_TRUE;
    }
    if (offset == IWDG_EWCR) {
        w->regs[IWDG_EWCR / 4u] = value;
        return MM_TRUE;
    }
    return MM_TRUE;
}

static mm_bool wwdg_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct wwdg_state *w = (struct wwdg_state *)opaque;
    if (value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > WWDG_SIZE) return MM_FALSE;
    if (!wwdg_clock_enabled()) {
        *value_out = 0;
        return MM_TRUE;
    }
    memcpy(value_out, (mm_u8 *)w->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool wwdg_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct wwdg_state *w = (struct wwdg_state *)opaque;
    if (size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > WWDG_SIZE) return MM_FALSE;
    if (!wwdg_clock_enabled()) {
        return MM_TRUE;
    }
    if (offset == WWDG_CR) {
        w->regs[WWDG_CR / 4u] = value & 0xFFu;
        w->counter = w->regs[WWDG_CR / 4u] & 0x7Fu;
        return MM_TRUE;
    }
    if (offset == WWDG_CFR) {
        w->regs[WWDG_CFR / 4u] = value;
        return MM_TRUE;
    }
    if (offset == WWDG_SR) {
        w->regs[WWDG_SR / 4u] &= ~value;
        return MM_TRUE;
    }
    memcpy((mm_u8 *)w->regs + offset, &value, size_bytes);
    return MM_TRUE;
}

mm_u32 *mm_stm32u585_rcc_regs(void)
{
    return rcc.regs;
}

mm_u64 mm_stm32u585_cpu_hz(void)
{
    return rcc.cpu_hz;
}

void mm_stm32u585_exti_set_nvic(struct mm_nvic *nvic)
{
    g_exti_nvic = nvic;
    g_wdg_nvic = nvic;
}

void mm_stm32u585_watchdog_tick(mm_u64 cycles)
{
    static const mm_u32 iwdg_presc_div[8] = { 4u, 8u, 16u, 32u, 64u, 128u, 256u, 256u };
    mm_u64 cpu_hz = mm_stm32u585_cpu_hz();

    if (wwdg_clock_enabled() && wwdg.counter != 0u && (wwdg.regs[WWDG_CR / 4u] & 0x80u) != 0u) {
        mm_u32 wdgtb = (wwdg.regs[WWDG_CFR / 4u] >> 11) & 0x7u;
        mm_u64 step = 4096u * (mm_u64)(1u << wdgtb);
        wwdg.accum += cycles;
        while (wwdg.accum >= step) {
            wwdg.accum -= step;
            if (wwdg.counter > 0u) {
                wwdg.counter--;
                wwdg.regs[WWDG_CR / 4u] = (wwdg.regs[WWDG_CR / 4u] & ~0x7Fu) | (wwdg.counter & 0x7Fu);
                if (wwdg.counter == 0x40u && (wwdg.regs[WWDG_CFR / 4u] & (1u << 9)) != 0u) {
                    wwdg.regs[WWDG_SR / 4u] |= 1u;
                    if (g_wdg_nvic != 0) {
                        mm_nvic_set_pending(g_wdg_nvic, 0u, MM_TRUE);
                    }
                }
                if (wwdg.counter == 0x3Fu) {
                    mm_system_request_reset();
                    break;
                }
            }
        }
    }

    if (iwdg.running) {
        mm_u32 pr = iwdg.regs[IWDG_PR / 4u] & 0x7u;
        mm_u64 ticks_per_sec;
        mm_u64 cycles_per_tick;
        mm_u64 lsi = 32000u;
        mm_u32 div = iwdg_presc_div[pr];
        ticks_per_sec = lsi / (mm_u64)div;
        if (ticks_per_sec == 0) ticks_per_sec = 1;
        if (cpu_hz == 0) cpu_hz = 1;
        cycles_per_tick = cpu_hz / ticks_per_sec;
        if (cycles_per_tick == 0) cycles_per_tick = 1;
        iwdg.accum += cycles;
        while (iwdg.accum >= cycles_per_tick) {
            iwdg.accum -= cycles_per_tick;
            if (iwdg.counter > 0u) {
                iwdg.counter--;
            }
            if (iwdg.counter == 0u) {
                mm_system_request_reset();
                break;
            }
        }
    }
}

mm_bool mm_stm32u585_register_mmio(struct mmio_bus *bus)
{
    struct mmio_region reg;

    memset(&rcc, 0, sizeof(rcc));
    memset(&pwr, 0, sizeof(pwr));
    memset(&tzsc_s, 0, sizeof(tzsc_s));
    memset(&tzsc_ns, 0, sizeof(tzsc_ns));
    memset(&tzic_s, 0, sizeof(tzic_s));
    memset(&tzic_ns, 0, sizeof(tzic_ns));
    memset(&tzsc2_s, 0, sizeof(tzsc2_s));
    memset(&tzsc2_ns, 0, sizeof(tzsc2_ns));
    memset(&tzic2_s, 0, sizeof(tzic2_s));
    memset(&tzic2_ns, 0, sizeof(tzic2_ns));
    memset(&rng, 0, sizeof(rng));
    memset(&hash_accel, 0, sizeof(hash_accel));
    memset(&aes_accel, 0, sizeof(aes_accel));
    memset(&pka_accel, 0, sizeof(pka_accel));
    memset(&exti, 0, sizeof(exti));
    memset(&iwdg, 0, sizeof(iwdg));
    memset(&wwdg, 0, sizeof(wwdg));
    memset(&flash_ctl, 0, sizeof(flash_ctl));
    memset(gpio, 0, sizeof(gpio));
    mpcbb_init_defaults();
    memset(&gpdma1, 0, sizeof(gpdma1));
    rcc.regs[RCC_CR / 4] |= 1u;
    rcc_update_ready(&rcc);
    rcc_update_sysclk(&rcc);
    hash_ctx[0].state = &hash_accel;
    hash_ctx[0].secure_alias = MM_FALSE;
    hash_ctx[0].rcc = &rcc;
    hash_ctx[0].tzsc = &tzsc_s;
    hash_ctx[0].clock_enabled = hash_clock_enabled;
    hash_ctx[0].requires_secure = hash_requires_secure;
    hash_ctx[1].state = &hash_accel;
    hash_ctx[1].secure_alias = MM_TRUE;
    hash_ctx[1].rcc = &rcc;
    hash_ctx[1].tzsc = &tzsc_s;
    hash_ctx[1].clock_enabled = hash_clock_enabled;
    hash_ctx[1].requires_secure = hash_requires_secure;
    aes_ctx[0].state = &aes_accel;
    aes_ctx[0].secure_alias = MM_FALSE;
    aes_ctx[0].rcc = &rcc;
    aes_ctx[0].tzsc = &tzsc_s;
    aes_ctx[0].is_saes = MM_FALSE;
    aes_ctx[0].clock_enabled = aes_clock_enabled;
    aes_ctx[0].requires_secure = aes_requires_secure;
    aes_ctx[1].state = &aes_accel;
    aes_ctx[1].secure_alias = MM_TRUE;
    aes_ctx[1].rcc = &rcc;
    aes_ctx[1].tzsc = &tzsc_s;
    aes_ctx[1].is_saes = MM_FALSE;
    aes_ctx[1].clock_enabled = aes_clock_enabled;
    aes_ctx[1].requires_secure = aes_requires_secure;
    pka_ctx[0].state = &pka_accel;
    pka_ctx[0].secure_alias = MM_FALSE;
    pka_ctx[0].rcc = &rcc;
    pka_ctx[0].tzsc = &tzsc_s;
    pka_ctx[0].clock_enabled = pka_clock_enabled;
    pka_ctx[0].requires_secure = pka_requires_secure;
    pka_ctx[1].state = &pka_accel;
    pka_ctx[1].secure_alias = MM_TRUE;
    pka_ctx[1].rcc = &rcc;
    pka_ctx[1].tzsc = &tzsc_s;
    pka_ctx[1].clock_enabled = pka_clock_enabled;
    pka_ctx[1].requires_secure = pka_requires_secure;
    saes_ctx[0].state = &saes_accel;
    saes_ctx[0].secure_alias = MM_FALSE;
    saes_ctx[0].rcc = &rcc;
    saes_ctx[0].tzsc = &tzsc_s;
    saes_ctx[0].is_saes = MM_TRUE;
    saes_ctx[0].clock_enabled = aes_clock_enabled;
    saes_ctx[0].requires_secure = aes_requires_secure;
    saes_ctx[1].state = &saes_accel;
    saes_ctx[1].secure_alias = MM_TRUE;
    saes_ctx[1].rcc = &rcc;
    saes_ctx[1].tzsc = &tzsc_s;
    saes_ctx[1].is_saes = MM_TRUE;
    saes_ctx[1].clock_enabled = aes_clock_enabled;
    saes_ctx[1].requires_secure = aes_requires_secure;
    rng.regs[RNG_CR_OFFSET / 4] = 0x00871f00u;
    rng.regs[RNG_HTCR_OFFSET / 4] = 0x000072acu;
    flash_ctl.regs[FLASH_ACR / 4] = 0x00000013u;
    flash_ctl.regs[FLASH_NSCR / 4] = 0x00000001u;
    flash_ctl.regs[FLASH_SECCR / 4] = 0x00000001u;
    iwdg.regs[IWDG_RLR / 4] = 0x00000FFFu;
    iwdg.regs[IWDG_WINR / 4] = 0x00000FFFu;
    wwdg.regs[WWDG_CR / 4] = 0x0000007Fu;
    wwdg.regs[WWDG_CFR / 4] = 0x0000007Fu;
    wwdg.counter = 0x7Fu;
    exti.regs[EXTI_IMR1 / 4u] = 0xFFFE0000u;

    /* RCC */
    reg.base = RCC_BASE;
    reg.size = RCC_SIZE;
    reg.opaque = &rcc;
    reg.read = rcc_read;
    reg.write = rcc_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    /* RCC secure alias */
    reg.base = RCC_SEC_BASE;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* PWR */
    reg.base = PWR_BASE;
    reg.size = PWR_SIZE;
    reg.opaque = &pwr;
    reg.read = pwr_read;
    reg.write = pwr_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    /* PWR secure alias */
    reg.base = PWR_SEC_BASE;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* UCPD1 */
    reg.base = UCPD1_BASE;
    reg.size = UCPD1_SIZE;
    reg.opaque = &ucpd1_state;
    reg.read = ucpd_read;
    reg.write = ucpd_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    /* UCPD1 secure alias */
    reg.base = UCPD1_SEC_BASE;
    reg.opaque = &ucpd1_state_sec;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* CRS */
    reg.base = CRS_BASE;
    reg.size = CRS_SIZE;
    reg.opaque = &crs;
    reg.read = simple_blk_read;
    reg.write = simple_blk_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    /* CRS secure alias */
    reg.base = CRS_SEC_BASE;
    reg.opaque = &crs_sec;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* OTG FS */
    reg.base = OTG_FS_BASE;
    reg.size = OTG_FS_SIZE;
    reg.opaque = &otg_fs;
    reg.read = otg_read;
    reg.write = otg_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    /* OTG FS secure alias */
    reg.base = OTG_FS_SEC_BASE;
    reg.opaque = &otg_fs_sec;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* FLASH controller */
    reg.base = FLASH_BASE;
    reg.size = FLASH_SIZE;
    reg.opaque = &flash_ctl;
    reg.read = flash_read;
    reg.write = flash_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    /* FLASH secure alias */
    reg.base = FLASH_SEC_BASE;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

