imbluedabr/m33mu/cpu/stm32u585/stm32u585_mmio.c
    /* GTZC1 TZSC secure */
    reg.base = GTZC1_TZSC_S_BASE;
    reg.size = GTZC_TZSC_SIZE;
    reg.opaque = &tzsc_s;
    reg.read = simple_blk_read;
    reg.write = simple_blk_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* GTZC1 TZSC non-secure alias */
    reg.base = GTZC1_TZSC_NS_BASE;
    reg.opaque = &tzsc_ns;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* GTZC1 TZIC secure */
    reg.base = GTZC1_TZIC_S_BASE;
    reg.size = GTZC_TZIC_SIZE;
    reg.opaque = &tzic_s;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* GTZC1 TZIC non-secure alias */
    reg.base = GTZC1_TZIC_NS_BASE;
    reg.opaque = &tzic_ns;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* GTZC2 TZSC secure */
    reg.base = GTZC2_TZSC_S_BASE;
    reg.size = GTZC_TZSC_SIZE;
    reg.opaque = &tzsc2_s;
    reg.read = simple_blk_read;
    reg.write = simple_blk_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* GTZC2 TZSC non-secure alias */
    reg.base = GTZC2_TZSC_NS_BASE;
    reg.opaque = &tzsc2_ns;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* GTZC2 TZIC secure */
    reg.base = GTZC2_TZIC_S_BASE;
    reg.size = GTZC_TZIC_SIZE;
    reg.opaque = &tzic2_s;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* GTZC2 TZIC non-secure alias */
    reg.base = GTZC2_TZIC_NS_BASE;
    reg.opaque = &tzic2_ns;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* MPCBB1..4 (non-secure and secure aliases) */
    reg.size = MPCBB_SIZE;
    reg.read = mpcbb_read;
    reg.write = mpcbb_write;
    reg.base = MPCBB1_BASE;
    reg.opaque = &mpcbb[0];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = MPCBB1_SEC_BASE;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = MPCBB2_BASE;
    reg.opaque = &mpcbb[1];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = MPCBB2_SEC_BASE;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = MPCBB3_BASE;
    reg.opaque = &mpcbb[2];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = MPCBB3_SEC_BASE;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = MPCBB4_BASE;
    reg.opaque = &mpcbb[3];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = MPCBB4_SEC_BASE;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* AES (non-secure and secure aliases) */
    reg.base = AES_BASE;
    reg.size = AES_SIZE;
    reg.opaque = &aes_ctx[0];
    reg.read = aes_read;
    reg.write = aes_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = AES_SEC_BASE;
    reg.opaque = &aes_ctx[1];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* HASH (non-secure and secure aliases) */
    reg.base = HASH_BASE;
    reg.size = HASH_SIZE;
    reg.opaque = &hash_ctx[0];
    reg.read = hash_read;
    reg.write = hash_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = HASH_SEC_BASE;
    reg.opaque = &hash_ctx[1];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* PKA (non-secure and secure aliases) */
    reg.base = PKA_BASE;
    reg.size = PKA_SIZE;
    reg.opaque = &pka_ctx[0];
    reg.read = pka_read;
    reg.write = pka_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = PKA_SEC_BASE;
    reg.opaque = &pka_ctx[1];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* SAES (non-secure and secure aliases) */
    reg.base = SAES_BASE;
    reg.size = SAES_SIZE;
    reg.opaque = &saes_ctx[0];
    reg.read = aes_read;
    reg.write = aes_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = SAES_SEC_BASE;
    reg.opaque = &saes_ctx[1];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* RNG (non-secure and secure aliases) */
    reg.base = RNG_BASE;
    reg.size = RNG_SIZE;
    rng_ctx[0][0] = &rng;
    rng_ctx[0][1] = (void *)0;
    rng_ctx[0][2] = &rcc;
    rng_ctx[0][3] = &tzsc_s;
    reg.opaque = rng_ctx[0];
    reg.read = rng_read;
    reg.write = rng_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = RNG_SEC_BASE;
    rng_ctx[1][0] = &rng;
    rng_ctx[1][1] = (void *)1;
    rng_ctx[1][2] = &rcc;
    rng_ctx[1][3] = &tzsc_s;
    reg.opaque = rng_ctx[1];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* EXTI (non-secure and secure aliases) */
    reg.base = EXTI_BASE;
    reg.size = EXTI_SIZE;
    reg.opaque = &exti;
    reg.read = exti_read;
    reg.write = exti_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = EXTI_SEC_BASE;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* IWDG (non-secure and secure aliases) */
    reg.base = IWDG_BASE;
    reg.size = IWDG_SIZE;
    reg.opaque = &iwdg;
    reg.read = iwdg_read;
    reg.write = iwdg_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = IWDG_SEC_BASE;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* WWDG (non-secure and secure aliases) */
    reg.base = WWDG_BASE;
    reg.size = WWDG_SIZE;
    reg.opaque = &wwdg;
    reg.read = wwdg_read;
    reg.write = wwdg_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = WWDG_SEC_BASE;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* GPDMA1 (non-secure and secure aliases) */
    reg.size = 0x1000u;
    reg.read = gpdma_read;
    reg.write = gpdma_write;
    reg.base = 0x40020000u; /* GPDMA1 */
    reg.opaque = &gpdma1;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = 0x50020000u; /* SEC_GPDMA1 */
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* GPIO A..I: NS alias 0x4202xxxx, Secure alias 0x5202xxxx */
    {
        mm_u32 base_ns = 0x42020000u;
        mm_u32 base_s  = 0x52020000u;
        int i;
        for (i = 0; i < 9; ++i) {
            /* NS */
            reg.base = base_ns + (mm_u32)(i * 0x400u);
            reg.size = 0x400u;
            gpio_ctx[i * 2][0] = &gpio[i];
            gpio_ctx[i * 2][1] = (void *)0; /* not secure alias */
            gpio_ctx[i * 2][2] = &rcc;
            gpio_ctx[i * 2][3] = (void *)(mm_uptr)i;
            reg.opaque = gpio_ctx[i * 2];
            reg.read = gpio_read;
            reg.write = gpio_write;
            if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

            /* Secure */
            reg.base = base_s + (mm_u32)(i * 0x400u);
            gpio_ctx[i * 2 + 1][0] = &gpio[i];
            gpio_ctx[i * 2 + 1][1] = (void *)1; /* secure alias */
            gpio_ctx[i * 2 + 1][2] = &rcc;
            gpio_ctx[i * 2 + 1][3] = (void *)(mm_uptr)i;
            reg.opaque = gpio_ctx[i * 2 + 1];
            if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
        }
    }

    return MM_TRUE;
}

void mm_stm32u585_flash_bind(struct mm_memmap *map,
                             mm_u8 *flash,
                             mm_u32 flash_size,
                             const struct mm_flash_persist *persist,
                             mm_u32 flags)
{
    if (map == 0) {
        return;
    }
    flash_ctl.flash = flash;
    flash_ctl.flash_size = flash_size;
    flash_ctl.persist = persist;
    flash_ctl.flags = flags;
    flash_ctl.base_s = map->flash_base_s;
    flash_ctl.base_ns = map->flash_base_ns;
    flash_ctl.dualbank_enabled = (flags & MM_TARGET_FLAG_DUALBANK) != 0u;
    flash_sync_option_regs(&flash_ctl);
    mm_memmap_set_flash_writer(map, flash_write_cb, &flash_ctl);
}

void mm_stm32u585_rng_set_nvic(struct mm_nvic *nvic)
{
    g_rng_nvic = nvic;
}
